# STUDENT DETAILS

In [1]:
# importing libraries
import pandas as pd 

#Loading the json file into pandas dataframe
df = pd.read_json('student_details.json', lines=True)
df.head()

    _id              name  exam_score  quiz_score  homework_score
0  5000        aimee Zank    1.463180   11.782733       11.782733
1  5001  Aurelia Menendez   60.060451   52.797907       52.797907
2  5002       Corliss Zuk   67.030771    6.301852        6.301852
3  5003        Bao Ziglar   71.643439   24.802213       24.802213
4  5004  Zachary Langlais   78.683851   90.296310       90.296310

In [2]:
df.shape

(200, 5)

# Insert new student detail in the list of json

In [3]:
def insert_record(name,exam_score,quiz_scores,homework_scores):
    """
    Summary: Inserting a record into a dataframe
    Parameters:
    arg1 : Name of the student
    arg2 : Exam score of that student
    arg3 : Quiz score of that student
    arg2 : homework score of that student
    Returns: None
    
    """
    new_id = df['_id'].iloc[-1] +1
    df.loc[len(df.index)] = [new_id,name,exam_score,quiz_scores,homework_scores]

In [4]:
insert_record('Isabel Guzman', 88.56, 90.67,78.99)

In [5]:
df.tail()

        _id              name  exam_score  quiz_score  homework_score
196  500196  Santiago Dollins   52.040526   33.633001       33.633001
197  500197     Tonisha Games   38.512696   31.162876       31.162876
198  500198    Timothy Harrod   11.907567   20.518800       20.518800
199  500199        Rae Kohout   82.117426   49.612955       49.612955
200  500200     Isabel Guzman   88.560000   90.670000       78.990000

# Edit already existing student detail

In [6]:
def edit_record(id_val,mod_column,mod_value):
    """
    Summary: Modifying an existing record in the dataframe
    Note : Record can be modified only using id column, as it is a unique key
    Parameters:
    arg1 : Student Id
    arg2 : The column/field to be modified
    arg3 : New value
    Returns: None
    
    """
    #Obtain index
    index_ = df[df['_id']==id_val].index.item()
    
    #Before editing
    print("Before editing")
    print(df.iloc[index_])
    
    #Updating record
    df.at[index_,mod_column]= mod_value
    
    #After modifying
    print(f"\nAfter editing")
    print(df.iloc[index_])

In [7]:
edit_record(500120,'homework_score',80.6)

Before editing
_id                         500120
name              Jenette Flanders
exam_score               22.044514
quiz_score               22.439581
homework_score           22.439581
Name: 120, dtype: object

After editing
_id                         500120
name              Jenette Flanders
exam_score               22.044514
quiz_score               22.439581
homework_score                80.6
Name: 120, dtype: object

# Delete an available student detail

In [8]:
def delete_record(id_val):
    """
    Summary: Deleting an existing record from the dataframe
    Note : Record can be deleted only using id column, as it is a unique key
    Parameters:
    arg1 : Student Id
    Returns: None
    
    """
    #Deleting a record
    df.drop(df.index[df['_id'] == id_val], inplace=True)
    df.reset_index(drop= True,inplace=True)

In [9]:
delete_record(500110)

In [12]:
df[108:112]

        _id               name  exam_score  quiz_score  homework_score
108  500108  Mikaela Meidinger   63.755951   59.522981       59.522981
109  500109        Flora Duell   40.682390   46.779720       46.779720
110  500111      Gennie Ratner   62.743100   92.180138       92.180138
111  500112   Myrtle Wolfinger   73.938955   35.993970       35.993970